Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ བརྒྱད་ སྟོང་ ཁོ་ན་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ གསེར་འོད་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $455 At that time there was in the east, beyond exactly eight thousand innumerable universes, a universe known as Suvarṇa­prabhā, and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཕྱོགས་ སུ་ རྣམ་པར་ བསྒྲགས་པ འི་ གོ་ཆ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one known as Armor of Universal Renown.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཡེ་ཤེས་ རྣམ་པར་ བསྒྲགས་པ འི་ གོ་ཆ་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Armor of the Renown of Wisdom would awaken to unsurpassable and perfect buddhahood . . .

source: དེ་ཡང་ འོངས་ ཏེ་ ཞེས་ བྱ་བ་ དང་ །_ དེ་ལྟ་ ལགས་སོ་ [73a] ཞེས་ བྱ་བ འི་ བར་ དུ་ སྔ་མ་ བཞིན་ དུ་ སྦྱར་ རོ །_།
en: . . . |#| “Yes, indeed,” answered the bodhisattva. [73.a]

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ བདུན་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཤེས་ འཕགས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $456 At that time there was in the east, beyond seven thousand innumerable universes, a universe known as Superior Knowledge, and |#| within it resided a thus-gone one known as Concealed Lord Who Is the Lamp Master of the Clouds.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཀུན་ ཏུ་ སྦས་པ འི་ བདག་པོ་ སྤྲིན་ གྱི་ དབང་ཕྱུག་ མར་མེ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་ |#| འཚོ་ ཞིང་ གཞེས་ ལ་ ཆོས་ ཀྱང་ སྟོན་ ཏེ །_
en: Abiding and remaining present there, he taught the Dharma.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱུ་སྐར་ གྱི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Tārarāja would awaken to unsurpassable and perfect buddhahood . . .

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ དྲུག་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རྟག་ ཏུ་ ཤིན་ཏུ་ སྨྲས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $457 At that time there was in the east, beyond six thousand innumerable universes, a universe known as Constant Masterful Expression, and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སྣང་བ་ མཐའ་ ཡ ས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one known as Amitābha.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ སྣང་བ་ ཆེན་པོ་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Great Light would awaken to unsurpassable and perfect buddhahood . . .

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ ལྔ་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མར་མེ་ བྱེད་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $458 At that time there was in the east, beyond five thousand innumerable universes, a universe known as Light Maker, and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ འོད་ ཀྱི་ དཀྱིལ་འཁོར་ ཡེ་ཤེས་ མཐའ་ ཡ ས་ འབྱུང་གནས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one known as Radiant Disk That Is the Source of Infinite Wisdom.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཡོན་ཏན་ རྒྱལ་པོ་ སྣང་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Guṇarājaprabha would awaken to unsurpassable and perfect buddhahood . . .

source: དེ་ དང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྒྲོན་མ་ བྱེད་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $459 Closer to here, there was a universe known as Lamp Maker , and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རྣམ་ པ་ དུ་མ་ རྣམ་པར་ འཕྲུལ་པ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one known as Numerous Manifestations.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཐོགས་པ་ མེད་པ འི་ གོ་ཆ་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ །_།
en: This blessed one had prophesied that a bodhisattva known as Unimpeded Armor would awaken to unsurpassable and perfect buddhahood.

source: ཅིའི་ཕྱིར་ འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ སྒྲོན་མ་ བྱེད་ ཅེས་ [73b] བྱ་བ ར་ བསྟན་ ཅེ་ན །_
en: $460 Why, one might wonder, was this universe known as Lamp Maker? [73.b]

source: འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ ན་ ཨུད་པ་ ལ་ དང་ །_ ཀུ་མུ་ད་ དང་ །_ པད་མ་ དཀར་པོ་ དག་ གིས་ ཁེབས་པ འི་ རྫིང་ རྒྱ་ ཆེ་ ཞིང་ ཡངས་པ་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ དག་ ཡོད་ དེ །_
en: In that universe there were innumerable great and vast pools of utpalas, kumudas, and white lotuses.

source: པད་མ་ དེ་དག་ ཀྱང་ འདབ་མ་ སྟོང་ ཆུ་བ་ མངོན་པར་ བརྟོལ་ ནས་ གྱེན་ དུ་ དཔག་ཚད་ བརྒྱད་ཅུ ར་ འཕགས་ པ་ སྟེ །_
en: Whenever a lotus flower would open and unfold its thousand petals, it would shine a light reaching eighty thousand leagues into the sky, and

source: པད་མ་ རེ་རེ་ ལས་ ཀྱང་ འོད་ཟེར་ འབུམ་ འབྱུང་བ ར་ བྱེད་ ཅིང་ །_ གྱེན་ དུ་ དང་ ཐུར་ དུ་ ཡང་ འོད་ཟེར་ སྟོང་ བྱུང་བ ར་ བྱེད་ ལ །_ དེ་བཞིན་ དུ་ ཕྱོགས་ ཐམས་ཅད་ དུ་ ཡང་ འོད་ཟེར་ སྟོང་ སྟོང་ འབྱུང་བ ར་ བྱེད་པ འི་ ཕྱིར་ རོ །_།
en: each petal of the lotuses would shine with a hundred thousand light rays, radiating above, below, and in all directions.

source: འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ཡང་ མིག་མངས་ རིས་ སུ་ བྲིས་པ །_ རིན་པོ་ཆེ འི་ ཕྲེང་བ ས་ བརྒྱན་པ །_ རིན་པོ་ཆེ འི་ སྐུད་པ ས་ བརྒྱན་པ །_
en: $461 That universe was of a checkered design and adorned with jewel garlands and jewel threads.

source: མིག་མངས་ རིས་ ཐམས་ཅད་ དུ་ ཡང་ རིན་པོ་ཆེ་ ལས་ བྱས་པ འི་ ཤིང་ ལྗོན་པ་ དག་ སྐྱེས་པ ར་ གྱུར་པ །_ གྱེན་ དུ་ དཔག་ཚད་ བདུན་ ཁྲི་ བདུན་ སྟོང་ མངོན་པར་ འཕགས་པ །_ ཐད་ཀ ར་ ནི་ དཔག་ཚད་ བརྒྱད་ ཁྲི་ བཞི་ སྟོང་ དུ་ ཡལ་ག་ དང་ །_ འདབ་མ་ དང་ །_ ལོ་ མ་ རབ་ཏུ་ སོང་བ འོ །_།
en: In each of the squares grew jewel trees that reached a height of seventy-seven thousand leagues. |#| To the sides the trees would extend their branches, twigs, and leaves, spanning a distance of eighty-four thousand leagues, and

source: རིན་པོ་ཆེ འི་ ཤིང་ རེ་རེ་ ལས་ ཀྱང་ ནོར་བུ་ བྱེ་བ་ ཕྲག་ བརྒྱད་ཅུ་ ཟོ་བ་ ཙམ་ དག་ རབ་ཏུ་ འཕྱང་ ངོ་ །_།
en: on each tree grew eight hundred million jewels.

source: སངས་རྒྱས་ ཀྱི་ ཞིང་ དེ་ ན་ ཤིང་ ལྗོན་པ་ དེ་དག་ ཀྱང་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་ དོ །_།
en: In that buddhafield there were trees of this kind beyond number and count.

source: སངས་རྒྱས་ ཀྱི་ ཞིང་ དེ་ ནི་ པད་མ འི་ འདབ་མ་ དེ་དག་ དང་ །_ ནོར་བུ་ དེ་དག་ གི་ འོད་ ཀྱིས་ རྟག་ ཏུ་ སྣང་བར་ བྱས་པ་ སྟེ །_ |#| འོད་ དེ་ཡང་ བཅོམ་ལྡན་འདས་ དེ འི་ འོད་ ཀྱིས་ མོག་མོག་པོ ར་ བྱས་པ འོ །_།
en: All the lotus petals and jewels would shine with a constant brilliance, and yet their light was eclipsed by that of the Blessed One.

source: བྱང་ཆུབ་ སེམས་དཔའ་ ཐོགས་པ་ མེད་པ འི་ གོ་ཆ ས་ སྣང་བ་ ཆེན་པོ་ དེ་ མཐོང་ སྟེ །_ |#| གསུང་ བསལ་བ འི་ སྒྲ་ དེ་ཡང་ ཐོས་ སོ །_།
en: $462 Now, the bodhisattva Unimpeded Armor had also noticed the great light and heard the sound of the clear voice.

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ རྣམ་པ་ དུ་མ་ རྣམ་པར་ འཕྲུལ་པ་ དེ་ ལ་ བྱང་ཆུབ་ སེམས་ དཔའ་ ཐོགས་པ་ མེད་པ འི་ གོ་ཆ ས་ ཞུས་པ །_
en: He therefore went before the blessed one Numerous Manifestations and asked,

source: བཅོམ་ལྡན་འདས་ འོད་ དེ་ དང་ །_ གསུང་ བསལ་བ འི་ སྒྲ་ དེ་ཡང་ སུ འི་ ལགས །_
en: “Blessed One, whose is this radiance and clear voice?”

source: རིགས་ ཀྱི་ བུ་ ནུབ་ཕྱོགས་ ཀྱི་ ཕྱོགས་ཆ ར་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ ཅེས་བྱ་བ་ ཡོད་ དེ
en: $463 “Noble son,” |#| “in the west, beyond a thousand innumerable universes, lies a universe known as Enduring.

source: [74a] གསོལ་པ །_
en: $464 The bodhisattva then said to that blessed one,

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་ དཔའ་ ཐོགས་པ་ མེད་པ འི་ གོ་ཆ འི་ ལག་པ ར་ པད་མ་ ཆེན་པོ་ གཅིག་ བྱིན་ ཏེ །_
en: $465 The blessed thus-gone Numerous Manifestations then placed a great lotus flower in the bodhisattva Unimpeded Armor’s hand and said,

source: ང འི་ ཚིག་ གིས་ དེ་བཞིན་ དུ་ གསོལ་ ཅིག _།
en: inquire with him appropriately on my behalf.”

source: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་ བཅོམ་ལྡན་འདས་ ཀྱིས་ སྐབས་ ཕྱེ་ ནས །_ |#| བཅོམ་ལྡན་འདས་ དེ འི་ ཞབས་ ལ་ མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ །_
en: $466 Thus, having received his permission, the bodhisattva bowed his head to the feet of that blessed one.

source: འདི་ལྟ་སྟེ །_ སྐྱེས་བུ་ སྟོབས་ དང་ ལྡན་པ་ ཞིག་ གིས་ ལག་པ་ བསྐུམ་པ་ རྐྱོང་བ ར་ བྱེད་པ འམ །_ ལག་པ་ བརྐྱང་བ་ སྐུམ་པ ར་ བྱེད་པ འི་ སྐད་ཅིག་ དང་ །_ ཐང་ ཅིག་ དང་ །_ ཡུད་ཙམ་ དེས་ འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ནས་ མི་སྣང་བ ར་ གྱུར་ ཏེ |#| འཇིག་རྟེན་ གྱི་ ཁམས་ མི་ མཇེད་ འདིར་ འདུག་ གོ །_།
en: As fast as an athlete can stretch out or bend an arm, he disappeared from that world and arrived at once, in one instant and in one moment, here in the world of Enduring.

source: དེ་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ ཤཱཀྱ་ ཐུབ་པ་ ག་ལ་བ་ དེར་ སོང་ སྟེ །_ |#| བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ནས་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: There he went to the place where the blessed thus-gone Śākyamuni was residing, bowed his head to the Blessed One’s feet in homage, and said,

source: བཅོམ་ལྡན་འདས་ བཅོམ་ལྡན་འདས་ ལ་ གནོད་པ་ ཆུང་ ངམ །_ ཉམ་ང་བ་ ཉུང་ ངམ །_ བསྐྱོད་པ་ ཡང་ ངམ །_ སྟོབས་ དང་ བདེ་བ ར་ རེག་པ་ ལ་ གནས་ སམ །_ ཞེས་ དེ་བཞིན་ གཤེགས་པ་ རྣམ་པ་ དུ་མ་ རྣམ་པར་ འཕྲུལ་པ་ སྙུན་ གསོལ་ ཞིང་ །_
en: “Blessed One, the blessed thus-gone Numerous Manifestations inquires whether you have encountered but little hardship or discomfort, and whether you remain healthy, strong, and at ease.

source: བཅོམ་ལྡན་འདས་ ལ་ པད་མ་ ཆེན་པོ་ འདི་ ཡང་ བཅོམ་ལྡན་འདས་ དེས་ བསྐུར་བ་ ལགས་ ན །_
en: He also sends you this great lotus flower.

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ བདག་ཅག་ ལ་ ཐུགས་ བརྩེ་བ འི་ སླད་ དུ་ བཞེས་ སུ་ གསོལ །_
en: Please accept it out of your love for us all.”

source: རིགས་ ཀྱི་ བུ་ ཅི་ བཅོམ་ལྡན་འདས་ དེ་ སྙུན་ མི་ མངའའམ །_ སྟོབས་ དང་ ལྡན་ ནམ །_ བདེ་བ་ དང་ ལྡན་ ནམ །_ འགྱུར་བ་ མི་ མངའ་ འམ །_
en: “Noble son, is that blessed one free from discomfort? |#| Is he strong, happy, and does he remain unchanged?”

source: འཇིག་རྟེན་ གྱི་ ཁམས་ དེ འི་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྣ་ཚོགས་ རྒྱལ་མཚན་ ཞེས་ བྱ་བ་ ཡོད་ དེ
en: $468 Situated beyond that universe was a universe known as Variegated Banner.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ མཆོག་ གི་ ཚོགས་ཅན་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Supreme Accumulations.

source: !བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ [74b] མཚན་ ས་ ཡན་ ཞེས་ བྱ་བ་ ཆོས་ ཀྱི་ སྐྱེས་ བྱིན་ ནས་ བཏང་ ངོ་ །_།
en: This blessed one now handed his bodhisattva regent [74.b] Free from Disease#29 a Dharma gift and dispatched him.

source: འཇིག་རྟེན་ གྱི་ ཁམས་ དེ འི་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཕྱོགས་ སུ་ རྣམ་པར་ བསྒྲགས་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $469 Situated beyond that universe was a universe known as Universal Renown.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སངས་རྒྱས་ མེ་ཏོག་ ཚོགས་ ཀྱི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone buddha Splendor of Numerous Flowers.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ དོན་ཡོད་ རྣམ་པར་ གནོན་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Meaningful Subduer.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རྡོ་རྗེ་ ཡང་དག་ གནས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $470 Situated beyond that universe was a universe known as Indestructible True Abode.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སངས་རྒྱས་ མེ་ཏོག་ མངོན་པར་ འཕགས་ པ འི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ །_
en: There resided the thus-gone buddha King of Superior Flowers.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ རིན་ཆེན་ མེ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Jewel Fire.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན །_ |#| འཇིག་རྟེན་ གྱི་ ཁམས་ ཙན་དན་ གྱི་ ཕུག་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $471 Situated beyond that universe was a universe known as Sandalwood Retreat.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རིན་པོ་ཆེ འི་ ལུས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Body of Jewels.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཀུན་ དུ་ བལྟས་པ འི་ ང་རོ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Ever-Present Roar.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རྩི་ ལྟ་བུ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $472 Situated beyond that universe was a universe known as Nectar-like.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་ པ་ དོན་ཡོད་ མིང་ བསྒྲགས་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Splendor of Meaningful Pronunciation.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ དོན་ཡོད་ གོ་ཆ་ བགོས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Bearer of the Meaningful Armor.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྨན་ འཕགས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $473 Situated beyond that universe was a universe known as Superior Medicine.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡོན་ཏན་ མཐའ་ ཡ ས་ བརྩོན་འགྲུས་ གོ་ཆ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Limitless Qualities of the Armor of Diligence.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཡང་དག་ པར་ བྱིན་པ འི་ བསླབ་པ་ བླངས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Receiver of True Blessings.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཀུན་ ནས་ བརྒྱན་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $474 Situated beyond that universe was a universe known as Thoroughly Adorned.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སེམས་བསྐྱེད་ མ་ ཐག་ ཏུ་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ སེམས་ ཀྱི་ རྒྱན་ མཛད་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Serving as the Ornament of the Minds of All Sentient Beings Immediately upon the Generation of the Mind of Awakening.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ལག་ ན་ པད་མ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Padmapāṇi. [75.a]

source: [75a] དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ གདུགས་ གཅིག་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $475 Situated beyond that universe was a universe known as Single Parasol .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཟླ་བ འི་ ཕྲེང་བ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Moon Garland.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ རིན་པོ་ཆེ འི་ ཕྲེང་བ་ ཞེས་ བྱ་ བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Ratnavali.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ པད་མ འི་ འོད་ཟེར་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $476 Situated beyond that universe was a universe known as Lotus Light Rays.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ འོད་ ཀྱི་ དཀྱིལ་འཁོར་ ཅན་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Luminous Disk.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཤིན་ཏུ་ རབ་ གནས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Supratiṣṭhita.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ བདེ་བ་ བཀོད་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $477 Situated beyond that universe was a universe known as Blissful Array.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡོན་ཏན་ རྒྱལ་པོ འི་ འོད་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་ |#| འཚོ་ ཞིང་ གཞེས་ ལ་ ཆོས་ ཀྱང་ སྟོན་ ཏེ །_
en: There resided the thus-gone Guṇarājaprabha. |#| Abiding and remaining present there, he taught the Dharma.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཡོན་ ཏན་ ཐམས་ཅད་ རབ་གནས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Stable Presence of All Good Qualities.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཡོན་ཏན་ མཐའ་ ཡ ས་ བཀོད་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $478 Situated beyond that universe was a universe known as Array of Infinite Qualities .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡོན་ཏན་ གྱི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་ |#| འཚོ་ ཞིང་ གཞེས་ ལ་ ཆོས་ ཀྱང་ སྟོན་ ཏེ །_
en: There resided the thus-gone Guṇapāramitā. |#| Abiding and remaining present there, he taught the Dharma.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཡོན་ཏན་ མཐའ་ ཡ ས་ བསྒྲགས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Renown of Infinite Qualities.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཕྱོགས་ སུ་ རབ་ གྲགས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $479 Situated beyond that universe was a universe known as Universal Renown.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ མར་མེ་མཛད་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone buddha Dīpaṃkara.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སྤྱོད་པ་ ཐམས་ཅད་ འགྱུར་བ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Totality of Activities.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ལྷ ས་ བརྒྱན་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $480 Situated beyond that universe was a universe known as Adorned by Gods.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ལྷ འི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone King of Gods.

source: བཅོམ་ ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཡེ་ཤེས་ འབྱུང་གནས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Jñānākara.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཤིང་ ཐག་ བཟང་པོ་ ཅན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $481 Situated beyond that universe was a universe known as Excellent Pinnacle.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ འོད་ ཀྱི་ འབྱུང་གནས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Source of Light.

source: འཚོ་ ཞིང་ གཞེས་ ལ་ ཆོས་ ཀྱང་ [75b] སྟོན་ ཏེ །_
en: Abiding and remaining present there, he taught the Dharma. [75.b]

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཡོན་ཏན་ འབྱུང་གནས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Guṇākara.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ བཟང་ལྡན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $482 Situated beyond that universe was a universe known as Bhadraka.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ མི་ འཇིགས་པ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ །_
en: There resided the thus-gone Abhaya .

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སྲིད་པ་ སེལ་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Purifier of Existence.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ བཟང་པོ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $483 Situated beyond that universe was a universe known as Bhadra.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ བྷ་ གི་ ར་ས འི་ སྲས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Son of Bhagirasa.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ མི་ འཇིགས་ ཐོབ་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Attainer of Fearlessness.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཤིན་ཏུ་ བཟང་པོ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $484 Situated beyond that universe was a universe known as Subhadra .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ མི་ འཇིགས་པ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Abhaya .

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ བག་ཚ་བ་ མེད་པ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Absence of Trepidation.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ པད་མ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $485 Situated beyond that universe was a universe known as Padma.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ པད་མ་ མཆོག་ གི་ འོད་ཟེར་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Light Rays of the Supreme Lotus.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ལག་ ན་ ཡེ་ཤེས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Jñānapāṇi.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཨུད་པ་ ལ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $486 Situated beyond that universe was a universe known as Utpala .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡེ་ཤེས་ ཨུད་པ་ ལ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Splendor of the Wisdom Utpala.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཡུལ་ ན་ མི་ གནས་པ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Not Involved with Objects.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རིན་ཆེན་ འཕགས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $487 Situated beyond that universe was a universe known as Superior Jewel .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དཀོན་མཆོག་ འབྱུང་གནས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Ratnākara.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཆོས་ ཀྱི་ འབྱུང་གནས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Dharmākara.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཟླ་བ་ བཟང་པོ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $488 Situated beyond that universe was a universe known as Sucandra. [76.a]

source: [76a] དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སྨོན་ལམ་ མཐའ་ ཡ ས་ གོ་ཆ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Armor of Infinite Aspirations.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ མེ་ཏོག་ རབ་ གཏོར་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Spreader of Flowers.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཤིན་ཏུ་ རབ་གནས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $489 Situated beyond that universe was a universe known as Supratiṣṭhita .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡོན་ཏན་ མཐའ་ ཡ ས་ རྒྱལ་པོ་ རབ་གནས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Firm King of Infinite Qualities.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཆོས་ འཕགས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Dharmodgata.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ནགས་ཚལ་ རབ་གནས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $490 Situated beyond that universe was a universe known as Stable Forest.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རིན་པོ་ཆེ འི་ ཕུང་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Heap of Jewels .

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ རྩི འི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Nectar King.

source: དེ འི་ ཡང་ འདབ་ ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྤོས་ ཅན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $491 Situated beyond that universe was a universe known as Endowed with Incense.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སཱ་ལ འི་ དབང་པོ འི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone King of Sal Trees.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཁྱད་པར་ བློ་གྲོས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Viśeṣamati.

source: དེ འི་ ཡང་ འདབ་ ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ པད་མ འི་ དཔལ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $492 Situated beyond that universe was a universe known as Padmaśrī .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རིན་པོ་ཆེ འི་ འོད་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Ratnaprabha.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཤིན་ཏུ་ མཐོང་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Sudarśana.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ལྷུན་པོ་ བརྩེགས་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $493 Situated beyond that universe was a universe known as Merukūṭa.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དཀོན་མཆོག་ བརྩེགས་པ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Ratnakūṭa.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ མེས་ བྱིན་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Agnidatta.

source: དེ འི་ ཡང་ འདབ་ ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མྱ་ངན་ བྲལ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $494 Situated beyond that universe was a universe known as Viśoka.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡོན་ཏན་ མཐའ་ ཡ ས་ བཀོད་པ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Array of Infinite Qualities.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཤིན་ཏུ་ ཡང་དག་ བརྟགས་ ཀྱི་ གོ་ཆ་ ཞེས་ བྱ་བ་ བཏང་ [76b] ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Armor of Perfect Analysis. [76.b]

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཡོན་ཏན་ ཐམས་ཅད་ རབ་གནས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $495 Situated beyond that universe was a universe known as Stable Presence of All Qualities.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ ཀུན་ ཏུ་ གཟིགས་པ འི་ ང་རོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone one, the worthy one, the perfect buddha All-Seeing Roar.
